In [2]:
import numpy as np
import pandas as pd

In [3]:
sd = pd.Series([1,2,3,4], index = 'cricket fball basketball golf'.split())
sd

cricket       1
fball         2
basketball    3
golf          4
dtype: int64

In [4]:
df = pd.DataFrame(np.random.rand(5,5), index='1 2 3 4 5'.split(), columns='A B C D E'.split())
df

          A         B         C         D         E
1  0.311307  0.416502  0.170073  0.448092  0.846723
2  0.016657  0.156381  0.581387  0.151836  0.718652
3  0.817404  0.392943  0.539580  0.006561  0.577082
4  0.595594  0.090313  0.819284  0.710948  0.020571
5  0.680734  0.486732  0.732755  0.006553  0.401146

In [5]:
df['F'] = df['A'] + df['B']

In [6]:
df

          A         B         C         D         E         F
1  0.311307  0.416502  0.170073  0.448092  0.846723  0.727809
2  0.016657  0.156381  0.581387  0.151836  0.718652  0.173038
3  0.817404  0.392943  0.539580  0.006561  0.577082  1.210347
4  0.595594  0.090313  0.819284  0.710948  0.020571  0.685906
5  0.680734  0.486732  0.732755  0.006553  0.401146  1.167466

In [7]:
df['A B F'.split()]

          A         B         F
1  0.311307  0.416502  0.727809
2  0.016657  0.156381  0.173038
3  0.817404  0.392943  1.210347
4  0.595594  0.090313  0.685906
5  0.680734  0.486732  1.167466

In [9]:
df2 = {'ID':['102' ,'103' ,'104' ,'105' ,'106'], 'NAME':['sg' ,'lg' ,'fg',' hg' ,'kg'], 'PROFIT':[5,6,4,8,9]}
df1 = pd.DataFrame(df2)
df1

    ID NAME  PROFIT
0  102   sg       5
1  103   lg       6
2  104   fg       4
3  105   hg       8
4  106   kg       9